# VersionGUID Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentVersion..::..VersionGUID Property
DocumentVersion Class See Also
---
The GUID portion of the DocumentVersion. The GUID is updated when changes are made to the document, but may not update with every change to the document. The GUID and save number are both necessary to uniquely identify a document version.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public Guid VersionGUID { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VersionGUID As Guid
	Get
```

Visual C++
---
```text
public:
property Guid VersionGUID {
	Guid get ();
}
```

# See Also
DocumentVersion Class
Autodesk.Revit.DB Namespace